In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# les librairies

In [15]:
superficie = pd.read_csv("superficie.csv",header=None)
nombre_de_sdb = pd.read_csv("nombre_de_sdb.csv",header=None)
nombre_de_chambres = pd.read_csv("nombre_de_chambres.csv",header=None)
# importer les trois datasets
# header=none permet d'indiquer a python que notre dataset n'a pas d'entete

In [16]:
superficie.head()

   0      1
0  0  28844
1  1  27667
2  2  14742
3  3  28089
4  4  11713

In [6]:
superficie.columns=['id','superficie'] # donner un nom de colonne

In [7]:
superficie.head()

   id  superficie
0   0       28844
1   1       27667
2   2       14742
3   3       28089
4   4       11713

In [8]:
nombre_de_sdb.head()

   0  1
0  0  2
1  1  1
2  2  1
3  3  3
4  4  1

In [10]:
nombre_de_sdb.columns=["id", "nombre_de_sdb"] # donner un nom de colonne

In [11]:
nombre_de_sdb.head()

   id  nombre_de_sdb
0   0              2
1   1              1
2   2              1
3   3              3
4   4              1

In [12]:
nombre_de_chambres.head()

   0  1
0  0  1
1  1  4
2  2  1
3  3  4
4  4  2

In [13]:
nombre_de_chambres.columns=["id", "nombre_de_chambres"]

In [14]:
nombre_de_chambres.head()

   id  nombre_de_chambres
0   0                   1
1   1                   4
2   2                   1
3   3                   4
4   4                   2